Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection
The current selection in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Add(Autodesk.Navisworks.Api.ModelItem)
Adds a ModelItem to the Selection
item: The ModelItem we wish to add to the selection

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.AddRange(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Adds a range of ModelItem to the Selection
range: The ModelItems we wish to add to the selection

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Changed
Occurs when the Selection contained in this object has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Changing
Occurs when the Selection contained in this object is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Clear
Removes all entries from

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.CopyFrom(Autodesk.Navisworks.Api.ModelItemCollection)
Copies the ModelItems from a ModelItemCollection and replaces the list of entries held
in SelectedItems
from: The ModelItems to reference for this operation

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.CopyFrom(Autodesk.Navisworks.Api.Selection)
Copies the Selection from selection and replaces the list of entries held
in SelectedItems

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.CopyFrom(Autodesk.Navisworks.Api.SelectionSourceCollection)
Updates the SelectionSources in Selection from selectionSources and
replaces the list of entries held in SelectedItems

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Copies the ModelItems from a IEnumerable>ModelItem< and
replaces the list of entries held in SelectedItems
from: The ModelItems to reference for this operation

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.CreateCopy
Creates a copy of the Selection associated with this object

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.IsEmpty
Returns true when there are no ModelItems in the selection

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection)~Autodesk.Navisworks.Api.Selection
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Remove(Autodesk.Navisworks.Api.ModelItem)
Removes a ModelItem from the Selection
item: The ModelItems we wish to remove from the selection

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.SelectAll
Selects all the ModelItems in the current document

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.SelectedItems
Collection of instances of ModelItem in this Selection

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.ToSelection
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentSelection.Value
The value of the current selection within the document